# <center>**Pr√©traitement des donn√©es**

# üö¢ Projet Titanic - Analyse de donn√©es et Mod√©lisation

Dans ce projet, nous allons travailler sur le c√©l√®bre dataset **Titanic**, disponible sur [Kaggle](https://www.kaggle.com/competitions/titanic/overview).

Ce jeu de donn√©es contient des informations sur les passagers du Titanic, telles que leur √¢ge, leur classe sociale, leur sexe, leur port d'embarquement, etc., ainsi que l'information cl√© : **ont-ils surv√©cu ou non** au naufrage.

Notre objectif sera :
- De **pr√©traiter** les donn√©es pour les rendre exploitables,
- D'**analyser** les diff√©rentes variables,
- Puis d'**appliquer des mod√®les de Machine Learning**, comme l'**arbre de d√©cision**, pour pr√©dire la survie des passagers.

Ce projet est une excellente opportunit√© pour s'entra√Æner √† la manipulation de donn√©es r√©elles et √† l'utilisation d'algorithmes de classification.

In [14]:
# Importer les biblioth√®ques n√©cessaires
import pandas as pd
import numpy as np

In [15]:
# Charger le fichier Titanic
df = pd.read_csv(r"C:\Users\TOSHIBA\Documents\analyse_project\titanic\train.csv")  
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [16]:
# Transformer la variable Survived
df["Survived"] = df["Survived"].replace({0: "Non-surv√©cu", 1: "Surv√©cu"})

# Transformer la variable Pclass
df["Pclass"] = df["Pclass"].replace({1: "1√®re classe", 2: "2√®me classe", 3: "3√®me classe"})

On remplace les valeurs num√©riques (0/1, 1/2/3) par des labels plus parlants pour faciliter l'interpr√©tation des r√©sultats.

In [17]:
# Remplacer les abr√©viations par les noms complets pour Embarked
df["Embarked"] = df["Embarked"].replace({
    'C': 'Cherbourg',
    'Q': 'Queenstown',
    'S': 'Southampton'
})

# Remplacer les valeurs manquantes par la modalit√© la plus fr√©quente
df["Embarked"] = df["Embarked"].fillna(df["Embarked"].mode()[0])

On remplace les codes (C, Q, S) par des noms complets et on remplace les valeurs manquantes (Missing) par la valeur la plus fr√©quente de la colonne.

In [18]:
# Remplacer les valeurs manquantes dans Age par la moyenne
# Remplacer les valeurs manquantes de Age par la moyenne
df["Age"] = df["Age"].fillna(df["Age"].mean())

Les √¢ges manquants sont remplac√©s par l'√¢ge moyen du dataset pour √©viter de perdre des donn√©es.

In [19]:
# Supprimer la colonne Cabin
df.drop(columns=['Cabin'], inplace=True)

La colonne Cabin contient trop de valeurs manquantes, elle est donc supprim√©e pour ne pas biaiser l'analyse.

In [20]:
# Supprimer les lignes dupliqu√©es
df.drop_duplicates(inplace=True)

On supprime d'√©ventuelles lignes en double pour garantir que chaque passager est unique dans notre analyse.

In [21]:
# V√©rifier s'il reste des valeurs manquantes
df.isna().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       0
dtype: int64

On s'assure qu'il ne reste plus de valeurs manquantes dans le dataset apr√®s nettoyage.

In [22]:
# Sauvegarder le DataFrame nettoy√©
df.to_csv(r"C:\Users\TOSHIBA\Documents\analyse_project\titanic\titanic_clean.csv", index=False)

On sauvegarde le fichier nettoy√© titanic_clean.csv dans le m√™me dossier que train.csv.